app/controllers/session_controller.rb

SELECT * FROM `users` WHERE (`users`.`user_id` = 3) LIMIT 1
---
  def get
    user = User.find_by_user_id(session[:user_id])