app/controllers/users_controller.rb

INSERT INTO `users` (`occupation`, `main_account`, `salt`, `created_at`, `nickname`, `line_phone`, `updated_at`, `user_address`, `lock`, `hashed_password`, `id_number`, `gender`, `user_id`, `user_name`, `birthday`, `age`, `mobile_phone`, `email`, `imei`) VALUES('', '', '1482851160.417262648215107', '2011-12-17 07:03:29', '456888', '', '2011-12-17 07:03:29', '', 'chengsheng', 'd4050c47425cca0c2d648d0a9d7e8005a94e8716', '', '', '', '', '2011-12-17', '', '', '', '')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save